[
  {
    "id": 1,
    "slug": "from-crud-to-mern",
    "title": "From CRUD to MERN: My Journey as a Web Developer",
    "date": "2024-12-18",
    "author": "Tanmay Hirodkar",
    "excerpt": "The journey from building a simple CRUD app on XAMPP to mastering the MERN stack was filled with challenges and growth...",
    "content": "<article> <p>It was 2 AM, and I stared at the screen, frustrated. The code that had always worked—my trusty PHP scripts running on XAMPP—was failing me. The web development landscape was shifting, and I was grappling with the reality that I needed to evolve to stay relevant. I had to make a decision: either adapt to new technologies or risk falling behind.</p> <p>This was the moment I decided to step out of my comfort zone and take on the challenge of learning the MERN stack. What followed was a journey filled with late-night breakthroughs, countless bugs, and the satisfaction of seeing my code come to life in ways I’d never imagined before.</p> <section> <h2>Early Days with XAMPP</h2> <p>When I first discovered XAMPP, it felt like magic. The ability to develop and test web applications locally was empowering. My first project was a simple CRUD app, which helped me understand database operations and user interfaces. Encouraged by this, I explored further and worked on:</p> <ul> <li><strong>Election Commission Portal:</strong> A simple web portal for the BLO of my area, aiding in election-related tasks.</li> <li><strong>Didactology:</strong> A PHP-based Learning Management System (LMS) that included features like secure login, course selling, batch management, and payment gateway integration. This project taught me about scalable systems and polished my development skills.</li> </ul> <p>These projects gave me a strong foundation and boosted my confidence as a developer.</p> </section> <section> <h2>Transition to MERN</h2> <p>By 2023, I realized that PHP and MySQL were no longer enough. The web development landscape demanded more: faster performance, scalability, and modern user experiences. Switching to the MERN stack (MongoDB, Express.js, React, Node.js) was a necessary leap, but it wasn’t easy. Moving from XAMPP’s GUI to command-line tools for Node.js and MongoDB required a mindset shift.</p> <p>Every step was a challenge:</p> <ul> <li><strong>Learning React and Node.js:</strong> I had to revisit fundamental JavaScript and grasp asynchronous programming.</li> <li><strong>Managing Time:</strong> Juggling this transition with academics, E-Cell responsibilities, stock market investments, and freelancing projects was a test of my time management skills.</li> </ul> <p>Despite the hurdles, the journey was rewarding.</p> </section> <section> <h2>Key Projects in MERN</h2> <p>As I delved into the MERN stack, I applied my learning to real-world applications:</p> <ul> <li><strong>Certificate Generator App:</strong> This was a key project, which helped more than 1000 students generate certificates quickly and efficiently.</li> <li><strong>SIH Letter Generator:</strong> Aimed at streamlining the process of generating documents for hackathons.</li> </ul> <p>These projects were a testament to my ability to adapt and solve real-world problems effectively.</p> </section> <section> <h2>Lessons Learned</h2> <ul> <li><strong>Adaptability is Key:</strong> Transitioning to the MERN stack taught me that staying relevant in tech means constantly evolving and unlearning outdated practices.</li> <li><strong>Hands-On Learning Matters:</strong> Practical application through projects like Didactology and the Fund Management System made learning more impactful.</li> <li><strong>Balance is Everything:</strong> Juggling studies, leadership roles, and development work isn’t easy, but it’s crucial for holistic growth.</li> </ul> </section> <section> <h2>Final Thoughts</h2> <p>Today, I’ve mastered the basics of Node.js, React, MongoDB, Tailwind, and Next.js. My journey from XAMPP to MERN wasn’t just about learning new tools—it was about growing as a developer and a professional. If you’re considering a similar transition, start small, be consistent, and embrace the challenges. Every project, big or small, adds to your experience and prepares you for future opportunities.</p> <p><strong>What’s your story?</strong> Let’s connect and share our journeys!</p> </section> </article>"
  },
  {
    "id": 2,
    "slug": "php-based-lms-didactology",
    "title": "Building Didactology: A PHP-Based Learning Management System",
    "date": "2023-05-10",
    "author": "Tanmay Hirodkar",
    "excerpt": "Didactology is an efficient LMS with features like secure logins, course selling, and payment integration. Here’s how I built it.",
    "content": "When I set out to build **Didactology**, I wanted to create an LMS that was both user-friendly and feature-rich. It was developed using **PHP**, **MySQL**, and other backend tools that allowed me to integrate functionalities like:\n\n- Secure login systems\n- User profile management\n- Course selling\n- Batch management\n- Payment gateway integration\n\nThis project not only helped streamline learning activities but also demonstrated my ability to create practical, scalable web solutions. I’m proud of what Didactology has achieved and the impact it has had on teachers and students alike."
  },
  {
    "id": 3,
    "slug": "sih-letter-generator",
    "title": "Streamlining Processes with the SIH Letter Generator",
    "date": "2024-07-15",
    "author": "Tanmay Hirodkar",
    "excerpt": "Creating the SIH Letter Generator simplified workflows and reduced manual effort significantly. Here’s the story behind it.",
    "content": "The **SIH Letter Generator** was born out of a need to simplify repetitive processes. By automating the generation of standardized letters, this tool:\n\n- Reduced manual effort\n- Improved accuracy\n- Saved hours of time for the team\n\nBuilding it allowed me to dive deep into automation and learn how technology can solve everyday problems efficiently. It’s projects like these that remind me why I’m passionate about development."
  }
]
